In [1]:
import pandas as pd
df=pd.read_csv("eda_hypothetical_dataset.csv")

In [2]:
df.head()

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,Income,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned
0,C1000,56.0,Female,Bangalore,2022-10-04,2023-10-10,C,1,800,800,33119.0,2.0,Desktop,LOYAL,0,1
1,C1001,69.0,Female,Kolkata,2024-01-31,2024-10-13,C,3,800,2400,47764.0,2.0,Desktop,SUMMER,0,1
2,C1002,46.0,Male,Delhi,2023-11-07,2024-05-22,B,30,1200,3600,49900.0,3.0,Desktop,NEWUSER,0,0
3,C1003,32.0,Male,Kolkata,2023-01-29,2023-11-28,C,2,800,1600,30213.0,4.0,Desktop,NEWUSER,0,1
4,C1004,60.0,Female,Mumbai,2023-04-02,2023-04-12,C,2,800,1600,62067.0,4.0,Desktop,NONE,0,0

In [4]:
mean=df['Income'].mean()
mean

np.float64(98935.17948717948)

In [5]:
median=df['Income'].median()
median

np.float64(48277.0)

In [7]:
mode=df['Income'].mode()
mode

0    40657.0
Name: Income, dtype: float64

In [8]:
varience=df['Income'].var()
varience

np.float64(508165771551.354)

In [9]:
std_dev=df['Income'].std()
std_dev

np.float64(712857.4693102079)

In [10]:
range_val=df['Income'].max()-df['Income'].min()
range_val

np.float64(10000999.0)

In [11]:
iqr=df['Income'].quantile(0.75)-df['Income'].quantile(0.25)
iqr

np.float64(21685.0)

In [14]:
skewness=df['Income'].skew()
skewness

np.float64(13.953983152509364)

In [15]:
percentile=df['Income'].quantile([0.1,0.25,0.50,0.75,0.90])
percentile

0.10    27117.2
0.25    37263.5
0.50    48277.0
0.75    58948.5
0.90    67369.0
Name: Income, dtype: float64

In [16]:
grouped=df.groupby('City').agg({
    'Income':['mean','median','std','min','max'],
    'Age':['mean','count']
})

In [17]:
grouped

                   Income                                             \
                     mean   median           std      min        max
City
Bangalore    47545.321429  47078.5  1.495920e+04  12731.0    74696.0
Bangalore    39433.000000  39433.0           NaN  39433.0    39433.0
Chennai     301725.564103  48794.0  1.593900e+06  17452.0  9999999.0
DELHI        57989.000000  57989.0           NaN  57989.0    57989.0
Delhi        49296.136364  49910.0  1.635428e+04  -1000.0    82329.0
Kolkata      49456.744186  49131.0  1.630709e+04  10110.0    79625.0
Mumbai       45173.361111  44728.5  1.670158e+04  18824.0    84646.0
chennai      63797.000000  63797.0           NaN  63797.0    63797.0
delhi        43728.000000  43728.0           NaN  43728.0    43728.0
mumbai       66936.000000  66936.0           NaN  66936.0    66936.0

                  Age
                 mean count
City
Bangalore   44.571429    28
Bangalore   20.000000     1
Chennai     44.897436    39
DELHI       45.000000     1
Delhi       45.928571    42
Kolkata     41.933333    45
Mumbai      42.611111    36
chennai     56.000000     1
delhi       43.000000     1
mumbai      31.000000     1